BorgTb/AsistenciaBackendFinal/esp32-cam-solo-rostro/esp32-cam-solo-rostro.ino
// ============================================================
// ESP32-CAM Sistema de Asistencia - VERSION SOLO FACIAL
// Centinela (Facial) + Fetch Backend + Gestion Web
// Sin sensor de huellas AS608
// ============================================================

#include <Arduino.h>
#include <WebServer.h>
#include <WiFi.h>
#include <esp_wifi.h> // <-- VITAL: Para el manejo avanzado de energía del WiFi
#include "LittleFS.h"
#include <ArduinoJson.h>
#include <HTTPClient.h>
#include "esp_camera.h"
#include "mqtt_client.h"
#include "esp_crt_bundle.h" 
#include <mbedtls/md.h>

esp_mqtt_client_handle_t mqtt_client = NULL;
bool mqttConnected = false;

#define FLASH_PIN 4
#define GREEN_LED_PIN 2
#define PIR_PIN 12

// ===== Flash PWM (evita enceguecer a las personas) =====
#define FLASH_PWM_FREQ     5000  // 5 kHz: sin flicker visible
#define FLASH_PWM_RES      8     // 8 bits -> duty 0..255
#define FLASH_PWM_DUTY_50  128   // 50% de 255
#define FLASH_DUTY_LOW    64   // 25%
#define FLASH_DUTY_MED    128  // 50%
#define FLASH_DUTY_HIGH   191  // 75%
#define FLASH_DUTY_FULL   255  // 100%

unsigned long ultimoDisparoPIR = 0; // Para evitar que envíe 10 fotos en un segundo

WebServer server(80);

// ===== Configuracion AP =====
const char* apSSID   = "ESP32-ASISTENCIA";
const char* apPASS   = "Asistencia2026";

// ===== WiFi externo configurable =====
String savedSSID = "";
String savedPASS = "";
bool   isOnline  = false;
String deviceMAC  = "";
unsigned long lastHeartbeat = 0;

// ===== Backend y MQTT =====
String backendURL     = "https://sculpture-kong-filtering-essential.trycloudflare.com";
String mqttBroker     = "";
String pinEnrol       = ""; 
bool   estaEnrolado   = false;
String adminHash     = "";
String lastCapturedImageUrl = "";
bool   camaraIniciada = false;
bool   wifiEstabaConectado = false;

// ===== Timestamp y Control de Tiempos =====
unsigned long bootEpoch = 0;
unsigned long cooldownAsistencia = 0;             
const unsigned long COOLDOWN_TIEMPO = 8000;       

// ===== Escaneo automatico =====
unsigned long lastFaceCheck = 0;
const unsigned long FACE_CHECK_INTERVAL = 6000;
unsigned long bloqueoAsistenciaHasta = 0;
const unsigned long BLOQUEO_MENU_MS = 30000;      // <-- OPTIMIZADO: Bajado a 30s para no congelar la web
bool baselineMovimientoLista = false;
uint32_t firmaMovimientoAnterior = 0;
const uint32_t UMBRAL_MOVIMIENTO = 1800;
bool rostroRegistroExitoso = false;
String ultimoErrorRegistro = "";

#define FOTOS_REQUERIDAS 3
int fotosTomadas = 0;

// ===== Maquina de estados =====
enum EstadoSistema {
  ESTADO_IDLE = 0,
  ESTADO_REGISTRO_FACIAL = 3,
  ESTADO_PROCESANDO_ASISTENCIA = 5
};

EstadoSistema estadoActual    = ESTADO_IDLE;
String nombreRegistrando      = "";
String rutRegistrando         = "";
String emailRegistrando       = "";
unsigned long tiempoUltimoEstado = 0;
const unsigned long TIMEOUT_REGISTRO = 30000;

int intentosFacial = 0;
String idParaRostro = "";
String logBuffer = "";
bool modoEdicionRostro = false;
String personaEditandoId = "";
unsigned long ultimoLogDiagnosticoOffline = 0;
String wifiDisconnectReason = "";
int wifiDisconnectCount = 0;
unsigned long wifiUptimeStart = 0;

// ============================================================
// PROTOTIPOS
// ============================================================
JsonArray loadArray(const char* path, DynamicJsonDocument& doc);
void saveArray(const char* path, DynamicJsonDocument& doc);
String identificarPorRostro();
bool registrarRostroEnBackend(String personaId);
bool agregarFotoEnBackend(String personaId);
void completarRegistroPersona();
void sincronizarAsistencias();
void sincronizarPersonasDesdeBackend();
void sincronizarTurnosDesdeBackend();
void sincronizarAsignacionesDesdeBackend();
void sincronizarErpConfigDesdeBackend();
void enviarAsistenciaAErp(const String& personaId, const String& nombre, const String& tipo, const String& metodo);
void sincronizarPendientes();
String procesarAsistencia(String personaId, String metodo);
void addLog(String msg);
unsigned long getTimestamp();
void actualizarBloqueoAsistencia(unsigned long duracionMs = BLOQUEO_MENU_MS);
bool asistenciaAutomaticaHabilitada(unsigned long ahora);
bool detectarMovimientoCamara();
uint32_t calcularFirmaMovimiento(const uint8_t* data, size_t len);
String jsonEscape(const String& src);
bool datosOfflineListos(String& motivo);
String motivoAsistenciaAutomatica(unsigned long ahora);
void flashExito();
void flashError();
bool resultadoAsistenciaExitosa(const String& resultado);
bool postAsistenciaEnBackend(const String& personaId, const String& nombre, const String& tipo, const String& metodo);
bool crearTurnoEnBackend(const String& nombre, const String& inicio, const String& fin, const String& dias, String& idBackend);
bool crearAsignacionEnBackend(const String& personaId, const String& turnoIdBackend, String& idBackend);
String obtenerTurnoBackendId(const String& turnoLocalId);
void sincronizarTurnosPendientes();
void sincronizarAsignacionesPendientes();
void enrolarDispositivo();
String buscarRutPersona(const String& personaId);

void handleWiFiConfig();
void handleRegisterUser();
void handleCreateTurn();
void handleAssignTurn();
void handleLimpiarDatos();
void handleSincronizar();
void handleFetchPersonas();
void handleSetBackend();
void handleEditarPersona();
void handleActualizarRostroPersona();
void handleAgregarFotosPersona();
void handleBorrarPersona();
void handleBorrarTurno();
void handleBorrarAsignacion();
void handleGetPersonas();
void handleGetTurnos();
void handleGetAsignaciones();
void handleGetAsistencias();
void handleUltimoRegistro();
void servirArchivo(const char* path, const char* tipo);


// ============================================================
// EVENTOS MQTT Y LOGS
// ============================================================
static void mqtt_event_handler(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data) {
  esp_mqtt_event_handle_t event = (esp_mqtt_event_handle_t)event_data;
  switch ((esp_mqtt_event_id_t)event_id) {
    case MQTT_EVENT_CONNECTED:
      addLog("MQTT Conectado por WebSockets");
      mqttConnected = true;
      esp_mqtt_client_subscribe(mqtt_client, "esp32/respuesta/facial", 0);
      break;
    case MQTT_EVENT_DISCONNECTED:
      mqttConnected = false;
      break;
    case MQTT_EVENT_DATA: {
      String topic = String(event->topic).substring(0, event->topic_len);
      String mensaje = String(event->data).substring(0, event->data_len);
      if (topic == "esp32/respuesta/facial") {
        DynamicJsonDocument doc(512);
        deserializeJson(doc, mensaje);
        if (doc["status"] == "ok") {
          addLog("Rostro guardado OK en Backend");
          flashExito();
          fotosTomadas++;
          String fileName = doc["file_name"].as<String>();
          String urlBase = backendURL;
          if (urlBase.endsWith("/")) urlBase = urlBase.substring(0, urlBase.length() - 1);
          lastCapturedImageUrl = urlBase + "/static/previews/" + fileName;
          rostroRegistroExitoso = true;
          ultimoErrorRegistro = "";
          
          if (fotosTomadas >= FOTOS_REQUERIDAS) {
            addLog("Registro completo: " + String(fotosTomadas) + " fotos de referencia guardadas");
            estadoActual = ESTADO_IDLE;
            nombreRegistrando = "";
            rutRegistrando = "";
            emailRegistrando = "";
            idParaRostro = "";
            modoEdicionRostro = false;
            personaEditandoId = "";
            fotosTomadas = 0;
          } else {
            addLog("Foto de registro #" + String(fotosTomadas) + " aceptada. Esperando siguiente captura en " + String(FOTOS_REQUERIDAS - fotosTomadas) + " foto(s)...");
          }
        } else {
          String detalle = doc["mensaje"].as<String>();
          addLog("Rostro rechazado: " + detalle);
          ultimoErrorRegistro = "Rostro rechazado: " + detalle;
        }
      }
      break;
    }
    default:
      break;
  }
}

void addLog(String msg) {
  Serial.println(msg);
  logBuffer += msg + "<br>";
  if (logBuffer.length() > 3000) {
    logBuffer = logBuffer.substring(logBuffer.length() - 3000);
  }
}

