BorgTb/AsistenciaBackendFinal/esp32-cam-solo-rostro/esp32-cam-solo-rostro.ino
  IPAddress dns(8, 8, 8, 8);
  WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE, dns);
  
  WiFi.begin(savedSSID.c_str(), savedPASS.c_str());
  
  int intentos = 0;
  while (WiFi.status() != WL_CONNECTED && intentos < 20) {
    delay(500);
    Serial.print(".");
    intentos++;
  }
  Serial.println();
  isOnline = (WiFi.status() == WL_CONNECTED);
  
  if (isOnline) {
    addLog("WiFi conectado");
    deviceMAC = WiFi.macAddress();
    deviceMAC.replace(":", "");
    addLog("MAC: " + deviceMAC);
    wifiEstabaConectado = true;
    enrolarDispositivo();
  } else {
    addLog("WiFi no disponible");
    wifiEstabaConectado = false;
    WiFi.disconnect();
  }
}

int reintentosWifi = 0;
unsigned long ultimoIntentoWifi = 0;

void verificarConexionWiFi() {
  if (savedSSID.length() == 0) return;

  if (WiFi.status() == WL_CONNECTED) {
    isOnline = true;
    reintentosWifi = 0;
    return;
  }

  if (!wifiEstabaConectado) return;

  isOnline = false;
  unsigned long ahora = millis();
  if (reintentosWifi > 0 && (ahora - ultimoIntentoWifi) < (reintentosWifi * 3000UL)) return;

  reintentosWifi++;
  ultimoIntentoWifi = ahora;
  addLog("WiFi perdido. Intento " + String(reintentosWifi) + "/5...");

  // Disconnect limpio antes de reconectar: evita el falso WL_WRONG_PASSWORD
  // que ocurre cuando el stack queda en estado de autenticacion inconsistente.
  WiFi.disconnect(false);
  delay(200);
  WiFi.begin(savedSSID.c_str(), savedPASS.c_str());

  int espera = 0;
  while (WiFi.status() != WL_CONNECTED && espera < 40) {
    delay(250);
    espera++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    isOnline = true;
    reintentosWifi = 0;
    addLog("WiFi reconectado");
    if (mqtt_client != NULL) {
      esp_mqtt_client_stop(mqtt_client);
      esp_mqtt_client_destroy(mqtt_client);
      mqtt_client = NULL;
      mqttConnected = false;
    }
  } else if (reintentosWifi >= 5) {
    addLog("5 intentos fallidos. Activando AP para reconfigurar...");
    WiFi.disconnect(true);
    delay(500);
    WiFi.mode(WIFI_AP_STA);
    WiFi.softAP(apSSID, apPASS, 6, 0, 4);
    Serial.println("AP SSID: " + String(apSSID));
    Serial.println("AP PASS: " + String(apPASS));
    Serial.println("AP IP: " + WiFi.softAPIP().toString());
    Serial.println("AP Canal: " + String(WiFi.channel()));
    WiFi.softAPConfig(IPAddress(192, 168, 4, 1), IPAddress(192, 168, 4, 1), IPAddress(255, 255, 255, 0));
    addLog("AP activo: 192.168.4.1 - PASS=" + String(apPASS));
    // NO reseteamos wifiEstabaConectado para que el watchdog
    // pueda reintentar si el router vuelve a estar disponible.
    reintentosWifi = 0;
  }
}
void mantenerConexionMQTT() {
  if (mqttBroker == "" || !isOnline) return;
  if (mqtt_client != NULL) return;
  
  String brokerUrl = mqttBroker;
  bool tieneEsquema = brokerUrl.startsWith("mqtt://") || brokerUrl.startsWith("ws://") || brokerUrl.startsWith("wss://") ||
                     brokerUrl.startsWith("http://") || brokerUrl.startsWith("https://");

  if (!tieneEsquema) {
    if (brokerUrl.indexOf(":") == -1) brokerUrl += ":1883";
    brokerUrl = "mqtt://" + brokerUrl;
  } else {
    if (brokerUrl.startsWith("http://")) brokerUrl = "ws://" + brokerUrl.substring(7);
    else if (brokerUrl.startsWith("https://")) brokerUrl = "wss://" + brokerUrl.substring(8);

    if (brokerUrl.startsWith("ws://") || brokerUrl.startsWith("wss://")) {
      if (!brokerUrl.endsWith("/mqtt")) brokerUrl += brokerUrl.endsWith("/") ? "mqtt" : "/mqtt";
    }
  }

  addLog("Conectando MQTT: " + brokerUrl);
  esp_mqtt_client_config_t mqtt_cfg = {};
  
  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    mqtt_cfg.broker.address.uri = brokerUrl.c_str();
    if (brokerUrl.startsWith("wss://")) {
      mqtt_cfg.broker.verification.crt_bundle_attach = esp_crt_bundle_attach;
    }
  #else
    mqtt_cfg.uri = brokerUrl.c_str();
    if (brokerUrl.startsWith("wss://")) {
      mqtt_cfg.crt_bundle_attach = esp_crt_bundle_attach;
    }
  #endif

  String lwtTopic = "esp32/lwt/" + deviceMAC;
  String lwtMsg = "{\"mac\":\"" + deviceMAC + "\",\"estado\":\"inactivo\"}";
  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    mqtt_cfg.session.last_will.topic = lwtTopic.c_str();
    mqtt_cfg.session.last_will.msg = lwtMsg.c_str();
    mqtt_cfg.session.last_will.msg_len = lwtMsg.length();
    mqtt_cfg.session.last_will.qos = 0;
    mqtt_cfg.session.last_will.retain = 0;
  #else
    mqtt_cfg.lwt_topic = lwtTopic.c_str();
    mqtt_cfg.lwt_msg = lwtMsg.c_str();
    mqtt_cfg.lwt_msg_len = lwtMsg.length();
    mqtt_cfg.lwt_qos = 0;
    mqtt_cfg.lwt_retain = 0;
  #endif

  mqtt_client = esp_mqtt_client_init(&mqtt_cfg);
  esp_mqtt_client_register_event(mqtt_client, (esp_mqtt_event_id_t)ESP_EVENT_ANY_ID, mqtt_event_handler, NULL);
  esp_mqtt_client_start(mqtt_client);
}

void enrolarDispositivo() {
  if (pinEnrol.length() == 0 || estaEnrolado) return;
  addLog("Enrolando dispositivo con PIN: " + pinEnrol);
  HTTPClient http;
  beginHttp(http, backendURL + "/api/dispositivos/enrolar");
  http.addHeader("Content-Type", "application/json");
  

  String macConDosPuntos = WiFi.macAddress();
  DynamicJsonDocument doc(256);
  doc["codigo"] = pinEnrol;
  doc["mac"] = macConDosPuntos;
  doc["ip"] = WiFi.localIP().toString();
  String payload;
  serializeJson(doc, payload);

  int code = http.POST(payload);
  if (code == 200) {
    addLog("Dispositivo enrolado correctamente");
    estaEnrolado = true;
    pinEnrol = "";
    String ssid = savedSSID, pass = savedPASS, backend = backendURL, mqtt = mqttBroker;
    saveConfig(ssid, pass, backend, mqtt, "");
  } else {
    addLog("Error enrolando: HTTP " + String(code) + " " + http.getString());
  }
  http.end();
}

void beginHttp(HTTPClient& http, const String& url) {
  http.begin(url);
  http.setTimeout(10000);
  if (deviceMAC.length() > 0) http.addHeader("X-Device-MAC", deviceMAC);
}

// ============================================================
// ADMIN LOCAL — SHA256 + Password
// ============================================================
String sha256(const String& input) {
  byte output[32];
  mbedtls_md_context_t ctx;
  mbedtls_md_init(&ctx);

  const mbedtls_md_info_t* info = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);
  if (info == NULL) {
    addLog("[ADMIN] ERROR: mbedtls SHA256 no disponible");
    mbedtls_md_free(&ctx);
    return "";
  }

  int ret = mbedtls_md_setup(&ctx, info, 0);
  if (ret != 0) {
    addLog("[ADMIN] ERROR: mbedtls_md_setup fallo (codigo " + String(ret) + ")");
    mbedtls_md_free(&ctx);
    return "";
  }

  ret = mbedtls_md_starts(&ctx);
  if (ret != 0) {
    addLog("[ADMIN] ERROR: mbedtls_md_starts fallo (codigo " + String(ret) + ")");
    mbedtls_md_free(&ctx);
    return "";
  }

