BorgTb/AsistenciaBackendFinal/esp32-cam-solo-rostro/esp32-cam-solo-rostro.ino
  ret = mbedtls_md_update(&ctx, (const unsigned char*)input.c_str(), input.length());
  if (ret != 0) {
    addLog("[ADMIN] ERROR: mbedtls_md_update fallo (codigo " + String(ret) + ")");
    mbedtls_md_free(&ctx);
    return "";
  }

  ret = mbedtls_md_finish(&ctx, output);
  if (ret != 0) {
    addLog("[ADMIN] ERROR: mbedtls_md_finish fallo (codigo " + String(ret) + ")");
    memset(output, 0, 32);
    mbedtls_md_free(&ctx);
    return "";
  }
  mbedtls_md_free(&ctx);

  char hex[65];
  for (int i = 0; i < 32; i++) {
    snprintf(hex + (i * 2), 3, "%02x", output[i]);
  }
  hex[64] = '\0';
  return String(hex);
}

void cargarAdminHash() {
  if (!LittleFS.exists("/admin.json")) {
    addLog("[ADMIN] /admin.json no existe, sin proteccion");
    return;
  }
  File file = LittleFS.open("/admin.json", "r");
  if (file) {
    DynamicJsonDocument doc(128);
    DeserializationError err = deserializeJson(doc, file);
    if (err) {
      addLog("[ADMIN] ERROR parseando /admin.json: " + String(err.c_str()));
      file.close();
      return;
    }
    if (doc.containsKey("admin_hash")) {
      adminHash = doc["admin_hash"].as<String>();
      addLog("[ADMIN] Hash cargado (" + String(adminHash.length()) + " chars)");
    } else {
      addLog("[ADMIN] /admin.json sin campo admin_hash");
    }
    file.close();
  }
}

void saveAdminHash() {
  DynamicJsonDocument doc(128);
  doc["admin_hash"] = adminHash;
  File file = LittleFS.open("/admin.json", "w");
  if (file) {
    serializeJson(doc, file);
    file.close();
    addLog("[ADMIN] Hash guardado en /admin.json");
  } else {
    addLog("[ADMIN] ERROR: no se pudo escribir /admin.json");
  }
}

bool verificarPassword(const String& password) {
  if (adminHash.length() == 0) return true;
  String hash = sha256(password);
  if (hash.length() == 0) {
    addLog("[ADMIN] ERROR: sha256 fallo durante verificacion - acceso denegado");
    return false;
  }
  bool ok = (hash == adminHash);
  if (!ok) addLog("[ADMIN] Password incorrecto (hash_len=" + String(hash.length()) + " admin_len=" + String(adminHash.length()) + ")");
  return ok;
}

bool requiereAdmin(WebServer& srv) {
  if (adminHash.length() == 0) return true;
  addLog("[ADMIN] Verificando acceso a " + srv.uri() + " (hash_len=" + String(adminHash.length()) + ")");
  if (!srv.hasArg("admin_password")) {
    addLog("[ADMIN] Falta admin_password en request");
    srv.send(401, "text/plain", "Se requiere contrasena de administrador");
    return false;
  }
  String pw = srv.arg("admin_password");
  addLog("[ADMIN] Password recibido (" + String(pw.length()) + " chars)");
  if (!verificarPassword(pw)) {
    addLog("[ADMIN] Password INCORRECTO");
    srv.send(401, "text/plain", "Contrasena incorrecta");
    return false;
  }
  addLog("[ADMIN] Acceso concedido a " + srv.uri());
  return true;
}

void sincronizarPersonasDesdeBackend() {
  if (!isOnline || WiFi.status() != WL_CONNECTED) {
    addLog("Sin WiFi: No se puede fetchear personas.");
    return;
  }
  addLog("Fetcheando lista de personas desde Backend...");
  HTTPClient http;
  beginHttp(http, backendURL + "/api/personas");

  int httpCode = http.GET();
  if (httpCode == 200) {
    DynamicJsonDocument doc(8192); 
    DeserializationError error = deserializeJson(doc, http.getStream());

    if (!error) {
      File file = LittleFS.open("/personas.json", "w");
      serializeJson(doc, file);
      file.close();
      addLog("Personas fetcheadas y guardadas. Total: " + String(doc.size()));
    } else {
      addLog("Error parseando JSON de personas.");
    }
  } else {
    addLog("Error HTTP al fetchear personas: " + String(httpCode));
  }
  http.end();
  yield();
}

// ============================================================
// LÓGICA DE ASISTENCIA BIOMÉTRICA
// ============================================================
String identificarPorRostro() {
  if (!camaraIniciada || !isOnline || WiFi.status() != WL_CONNECTED) return "";

  // Calidad reducida para identificación: más rápido de transmitir y procesar
  sensor_t* s = esp_camera_sensor_get();
  s->set_quality(s, 10);

  // Flash breve para iluminar el rostro
  ledcWrite(FLASH_PIN, FLASH_DUTY_LOW);
  delay(150);
  camera_fb_t* fb = esp_camera_fb_get();
  ledcWrite(FLASH_PIN, 0);

  // Restaurar calidad original para registro
  s->set_quality(s, 8);

  if (!fb) {
    addLog("Error: No se pudo capturar frame para identificacion");
    return "";
  }

  HTTPClient http;
  beginHttp(http, backendURL + "/api/facial/identificar");
  http.addHeader("Content-Type", "application/octet-stream");
  http.setTimeout(10000);

  // Enviar JPEG crudo directamente, sin Base64 (33% menos datos)
  int httpCode = http.POST(fb->buf, fb->len);
  esp_camera_fb_return(fb);

  String personaId = "";
  if (httpCode == 200) {
    DynamicJsonDocument doc(256);
    deserializeJson(doc, http.getString());
    if (doc.containsKey("persona_id")) {
      personaId = doc["persona_id"].as<String>();
    }
  } else if (httpCode != 404) {
    // 404 es "rostro no reconocido", es esperado — solo logueamos errores reales
    addLog("Identificacion HTTP error: " + String(httpCode));
  }
  http.end();
  return personaId;
}
bool turnoActivo(const String& personaId) {
  DynamicJsonDocument doc(1024);
  JsonArray asign = loadArray("/asignaciones.json", doc);
  for (JsonObject a : asign) {
    if (a["persona_id"] == personaId) return true;
  }
  return false;
}

String procesarAsistencia(String personaId, String metodo) {
  DynamicJsonDocument docP(2048);
  JsonArray personas = loadArray("/personas.json", docP);
  String nombre = "";
  
  for (JsonObject p : personas) {
    if (p["id"].as<String>() == personaId) {
      nombre = p["nombre"].as<String>();
      break;
    }
  }

  if (nombre == "") return "Persona ID no existe localmente";
  if (!turnoActivo(personaId)) return "Sin turno asignado: " + nombre;

  DynamicJsonDocument docA(2048);
  JsonArray asist = loadArray("/asistencias.json", docA);
  
  String tipo = "entrada";
  for (int i = asist.size() - 1; i >= 0; i--) {
    JsonObject a = asist[i];
    if (a["persona_id"] == personaId) {
      tipo = (String(a["tipo"].as<const char*>()) == "entrada") ? "salida" : "entrada";
      break;
    }
  }

  JsonObject a = asist.createNestedObject();
  a["persona_id"]   = personaId;
  a["nombre"]       = nombre;
  a["tipo"]         = tipo;
  a["metodo"]       = metodo;
  a["timestamp"]    = getTimestamp();
  a["sincronizado"] = false;

  if (postAsistenciaEnBackend(personaId, nombre, tipo, metodo)) {
    a["sincronizado"] = true;
  }
  
  saveArray("/asistencias.json", docA);

  if (isOnline) enviarAsistenciaAErp(personaId, nombre, tipo, metodo);

