BorgTb/AsistenciaBackendFinal/esp32-cam-solo-rostro/esp32-cam-solo-rostro.ino
  String tipoMayus = tipo;
  tipoMayus.toUpperCase();
  return tipoMayus + " OK: " + nombre + " (" + metodo + ")";
}

bool postAsistenciaEnBackend(const String& personaId, const String& nombre, const String& tipo, const String& metodo) {
  if (!isOnline || WiFi.status() != WL_CONNECTED) return false;
  if (personaId.startsWith("local-")) return false;

  HTTPClient http;
  beginHttp(http, backendURL + "/api/asistencias");
  http.addHeader("Content-Type", "application/json");
  

  DynamicJsonDocument payloadDoc(512);
  payloadDoc["persona_id"] = personaId;
  payloadDoc["nombre"] = nombre;
  payloadDoc["tipo"] = tipo;
  payloadDoc["metodo"] = metodo;
  payloadDoc["origen"] = "dispositivo";
  payloadDoc["sincronizado"] = true;
  String payload;
  serializeJson(payloadDoc, payload);

  int code = http.POST(payload);
  if (code != 200 && code != 201) {
    addLog("Asistencia local guardada, backend pendiente. Codigo: " + String(code));
    http.end();
    return false;
  }

  http.end();
  return true;
}

bool crearTurnoEnBackend(const String& nombre, const String& inicio, const String& fin, const String& dias, String& idBackend) {
  idBackend = "";
  if (!isOnline || WiFi.status() != WL_CONNECTED) return false;

  HTTPClient http;
  beginHttp(http, backendURL + "/api/turnos");
  http.addHeader("Content-Type", "application/json");
  

  DynamicJsonDocument payloadDoc(512);
  payloadDoc["nombre"] = nombre;
  payloadDoc["inicio"] = inicio;
  payloadDoc["fin"] = fin;
  payloadDoc["dias"] = dias;
  String payload;
  serializeJson(payloadDoc, payload);

  int code = http.POST(payload);
  if (code != 200 && code != 201) {
    addLog("Turno local guardado, backend pendiente. Codigo: " + String(code));
    http.end();
    return false;
  }

  DynamicJsonDocument respDoc(256);
  DeserializationError err = deserializeJson(respDoc, http.getString());
  http.end();
  if (!err && respDoc.containsKey("id")) {
    idBackend = respDoc["id"].as<String>();
    return idBackend.length() > 0;
  }

  addLog("Turno creado en backend sin ID util.");
  return false;
}

bool crearAsignacionEnBackend(const String& personaId, const String& turnoIdBackend, String& idBackend) {
  idBackend = "";
  if (!isOnline || WiFi.status() != WL_CONNECTED) return false;
  if (personaId.startsWith("local-") || turnoIdBackend.length() == 0) return false;

  HTTPClient http;
  beginHttp(http, backendURL + "/api/asignaciones");
  http.addHeader("Content-Type", "application/json");
  

  DynamicJsonDocument payloadDoc(512);
  payloadDoc["persona_id"] = personaId;
  payloadDoc["turno_id"] = turnoIdBackend;
  String payload;
  serializeJson(payloadDoc, payload);

  int code = http.POST(payload);
  if (code != 200 && code != 201) {
    addLog("Asignacion local guardada, backend pendiente. Codigo: " + String(code));
    http.end();
    return false;
  }

  DynamicJsonDocument respDoc(256);
  DeserializationError err = deserializeJson(respDoc, http.getString());
  http.end();
  if (!err && respDoc.containsKey("id")) {
    idBackend = respDoc["id"].as<String>();
  }
  return true;
}

String obtenerTurnoBackendId(const String& turnoLocalId) {
  DynamicJsonDocument doc(4096);
  JsonArray turnos = loadArray("/turnos.json", doc);
  for (JsonObject t : turnos) {
    if (t["id"].as<String>() == turnoLocalId) {
      if (t.containsKey("backend_id") && t["backend_id"].as<String>().length() > 0) {
        return t["backend_id"].as<String>();
      }
      String id = t["id"].as<String>();
      if (!id.startsWith("local-")) return id;
      return "";
    }
  }
  return "";
}

// ============================================================
// REGISTRO DE USUARIOS
// ============================================================
void completarRegistroPersona() {
  ultimoErrorRegistro = "";
  rostroRegistroExitoso = false;

  String idReal = "";
  bool personaCreadaEnBackend = false;

  if (isOnline && WiFi.status() == WL_CONNECTED) {
    HTTPClient http;
  beginHttp(http, backendURL + "/api/personas");
    http.addHeader("Content-Type", "application/json");
    

    DynamicJsonDocument bodyDoc(512);
    bodyDoc["nombre"] = nombreRegistrando;
    bodyDoc["rut"] = rutRegistrando;
    bodyDoc["email"] = emailRegistrando;
    String payload;
    serializeJson(bodyDoc, payload);

    int httpCode = http.POST(payload);
    if (httpCode == 200 || httpCode == 201) {
      String response = http.getString();
      DynamicJsonDocument respDoc(256);
      DeserializationError err = deserializeJson(respDoc, response);
      if (!err && respDoc.containsKey("id")) {
        idReal = respDoc["id"].as<String>();
        personaCreadaEnBackend = true;
        addLog("Usuario creado en BD ID: " + idReal);
      } else {
        addLog("Advertencia: backend no devolvio ID. Guardando registro local.");
      }
    } else {
      addLog("Advertencia BD (Cod:" + String(httpCode) + "). Guardando registro local.");
    }
    http.end();
  } else {
    addLog("Sin internet: guardando persona solo en memoria local.");
  }

  if (idReal == "") {
    idReal = "local-" + String(getTimestamp());
  }

  DynamicJsonDocument doc(2048);
  JsonArray personas = loadArray("/personas.json", doc);
  JsonObject p = personas.createNestedObject();
  p["id"]             = idReal;
  p["nombre"]         = nombreRegistrando;
  p["rut"]            = rutRegistrando;
  p["email"]          = emailRegistrando;
  p["fecha_registro"] = getTimestamp();
  p["sincronizado"]   = personaCreadaEnBackend;
  saveArray("/personas.json", doc);
  
  if (personaCreadaEnBackend && camaraIniciada) {
    addLog("Mire a la cámara para la foto...");
    idParaRostro = idReal;   
    intentosFacial = 0;
    fotosTomadas = 0;
    actualizarBloqueoAsistencia(60000); // 1 minuto de bloqueo para la foto es suficiente
    estadoActual = ESTADO_REGISTRO_FACIAL;
    tiempoUltimoEstado = millis();
  } else {
    if (!personaCreadaEnBackend) {
      addLog("Registro local completado (pendiente de sincronizacion con backend).");
    }
    rostroRegistroExitoso = true;
    estadoActual = ESTADO_IDLE;
    nombreRegistrando = ""; rutRegistrando = ""; emailRegistrando = "";
  }
}

bool registrarRostroEnBackend(String personaId) {
  if (!camaraIniciada || !isOnline || !mqttConnected || mqtt_client == NULL) return false;

  String imgBase64 = capturarImagenBase64();
  if (imgBase64.length() == 0) return false;

