BorgTb/AsistenciaBackendFinal/esp32-cam-solo-rostro/esp32-cam-solo-rostro.ino
// ============================================================
// HANDLERS WEB
// ============================================================
void handleWiFiConfig() {
  actualizarBloqueoAsistencia(60000);
  String ssid    = server.hasArg("ssid")    && server.arg("ssid").length()    > 0 ? server.arg("ssid")    : savedSSID;
  String pass    = server.hasArg("pass")    && server.arg("pass").length()    > 0 ? server.arg("pass")    : savedPASS;
  String backend = server.hasArg("backend") && server.arg("backend").length() > 0 ? server.arg("backend") : backendURL;
  String mqtt    = server.hasArg("mqtt")    && server.arg("mqtt").length()    > 0 ? server.arg("mqtt")    : mqttBroker;
  String pin     = server.hasArg("pin")     && server.arg("pin").length()     > 0 ? server.arg("pin")     : pinEnrol;

  if (server.hasArg("admin_password_new") && server.arg("admin_password_new").length() > 0) {
    if (adminHash.length() > 0) {
      if (!server.hasArg("admin_password_old") || !verificarPassword(server.arg("admin_password_old"))) {
        server.send(401, "text/plain", "Contrasena actual incorrecta");
        return;
      }
    }
    adminHash = sha256(server.arg("admin_password_new"));
    saveAdminHash();
  }

  saveConfig(ssid, pass, backend, mqtt, pin);
  server.send(200, "text/plain", "Guardado. Reiniciando...");
  delay(1500); ESP.restart();
}

void handleRegisterUser() {
  if (!requiereAdmin(server)) return;
  if (!server.hasArg("name") || !server.hasArg("rut")) { server.send(400, "text/plain", "Faltan datos"); return; }
  ultimoErrorRegistro = "";
  rostroRegistroExitoso = false;
  actualizarBloqueoAsistencia(60000);
  nombreRegistrando = server.arg("name"); rutRegistrando = server.arg("rut"); emailRegistrando = server.arg("email");
  completarRegistroPersona();
  server.send(200, "text/plain", "OK: Mire a la camara...");
}

void handleCreateTurn() {
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia();
  if (!server.hasArg("nombre") || !server.hasArg("inicio") || !server.hasArg("fin") || !server.hasArg("dias")) {
    server.send(400, "text/plain", "Datos incompletos");
    return;
  }
  DynamicJsonDocument doc(4096);
  JsonArray turnos = loadArray("/turnos.json", doc);
  JsonObject t = turnos.createNestedObject();

  String nombre = server.arg("nombre");
  String inicio = server.arg("inicio");
  String fin = server.arg("fin");
  String dias = server.arg("dias");
  String localId = "local-" + String(getTimestamp()) + "-" + String(turnos.size() + 1);
  String backendId = "";
  bool synced = crearTurnoEnBackend(nombre, inicio, fin, dias, backendId);

  t["id"] = synced && backendId.length() > 0 ? backendId : localId;
  t["backend_id"] = synced && backendId.length() > 0 ? backendId : "";
  t["nombre"] = nombre;
  t["inicio"] = inicio;
  t["fin"] = fin;
  t["dias"] = dias;
  t["sincronizado"] = synced;

  saveArray("/turnos.json", doc);
  server.send(200, "text/plain", synced ? "Turno creado y sincronizado" : "Turno creado local (pendiente sync)");
}

void handleAssignTurn() {
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia();
  if (!server.hasArg("persona") || !server.hasArg("turno")) {
    server.send(400, "text/plain", "Falta persona o turno");
    return;
  }
  DynamicJsonDocument doc(4096);
  JsonArray asignaciones = loadArray("/asignaciones.json", doc);
  String personaId = server.arg("persona");
  String turnoId = server.arg("turno");
  
  for (JsonObject a : asignaciones) {
    if (a["persona_id"] == personaId) {
      server.send(400, "text/plain", "Persona ya tiene turno asignado");
      return;
    }
  }

  String backendAsignacionId = "";
  bool synced = false;
  String turnoBackendId = obtenerTurnoBackendId(turnoId);
  if (turnoBackendId.length() == 0 && isOnline) {
    sincronizarTurnosPendientes();
    turnoBackendId = obtenerTurnoBackendId(turnoId);
  }
  if (turnoBackendId.length() > 0) {
    synced = crearAsignacionEnBackend(personaId, turnoBackendId, backendAsignacionId);
  }

  JsonObject a = asignaciones.createNestedObject();
  a["persona_id"]       = personaId;
  a["turno_id"]         = turnoId;
  a["fecha_asignacion"] = getTimestamp();
  a["sincronizado"]     = synced;
  if (backendAsignacionId.length() > 0) a["backend_id"] = backendAsignacionId;
  saveArray("/asignaciones.json", doc);
  server.send(200, "text/plain", synced ? "Turno asignado y sincronizado" : "Turno asignado local (pendiente sync)");
}

void handleLimpiarDatos() {
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia();
  if (!server.hasArg("codigo") || server.arg("codigo") != "1234") {
    server.send(403, "text/plain", "Codigo incorrecto");
    return;
  }
  const char* files[] = {"/personas.json", "/turnos.json", "/asignaciones.json", "/asistencias.json"};
  for (auto f : files) {
    File file = LittleFS.open(f, "w");
    file.println("[]");
    file.close();
  }
  addLog("Sistema limpiado");
  server.send(200, "text/plain", "Sistema limpiado correctamente");
}

void handleSincronizar() {
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia();
  if (!isOnline) { server.send(503, "text/plain", "Sin conexion"); return; }
  sincronizarPendientes();
  sincronizarPersonasDesdeBackend();
  sincronizarTurnosDesdeBackend();
  sincronizarAsignacionesDesdeBackend();
  server.send(200, "text/plain", "Sincronizacion ejecutada");
}

void handleFetchPersonas() {
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia();
  if (!isOnline) { server.send(503, "text/plain", "Sin conexion WiFi"); return; }
  sincronizarPersonasDesdeBackend();
  server.send(200, "text/plain", "Personas obtenidas. Revisa los logs.");
}

void handleSetBackend() {
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia();
  if (!server.hasArg("url")) { server.send(400, "text/plain", "Falta url"); return; }
  backendURL = server.arg("url");
  addLog("Backend actualizado: " + backendURL);
  server.send(200, "text/plain", "Backend: " + backendURL);
}

void handleEditarPersona() {
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia(60000);
  if (!server.hasArg("id") || !server.hasArg("name")) {
    server.send(400, "text/plain", "Faltan id o name");
    return;
  }

  String id = server.arg("id");
  String nuevoNombre = server.arg("name");
  String nuevoEmail = server.hasArg("email") ? server.arg("email") : "";
  nuevoNombre.trim();
  nuevoEmail.trim();

  if (nuevoNombre.length() == 0) {
    server.send(400, "text/plain", "Nombre invalido");
    return;
  }

  DynamicJsonDocument doc(4096);
  JsonArray arr = loadArray("/personas.json", doc);
  JsonObject objetivo;
  bool encontrado = false;
  for (JsonObject p : arr) {
    if (p["id"].as<String>() == id) {
      objetivo = p;
      encontrado = true;
      break;
    }
  }

  if (!encontrado) {
    server.send(404, "text/plain", "Persona no encontrada local");
    return;
  }

