BorgTb/AsistenciaBackendFinal/esp32-cam-solo-rostro/esp32-cam-solo-rostro.ino
  objetivo["nombre"] = nuevoNombre;
  objetivo["email"] = nuevoEmail;
  objetivo["sincronizado"] = false;

  bool synced = false;
  if (isOnline && WiFi.status() == WL_CONNECTED && !id.startsWith("local-")) {
    HTTPClient http;
  beginHttp(http, backendURL + "/api/personas/" + id);
    http.addHeader("Content-Type", "application/json");
    

    DynamicJsonDocument payloadDoc(512);
    payloadDoc["nombre"] = nuevoNombre;
    payloadDoc["email"] = nuevoEmail;
    String payload;
    serializeJson(payloadDoc, payload);

    int code = http.sendRequest("PATCH", payload);
    if (code == 200) {
      synced = true;
      objetivo["sincronizado"] = true;
      addLog("Persona editada y sincronizada: " + id);
    } else {
      addLog("Edicion local OK, backend pendiente. Codigo: " + String(code));
    }
    http.end();
  } else {
    addLog("Edicion local guardada (sin backend disponible)");
  }

  saveArray("/personas.json", doc);
  server.send(200, "text/plain", synced ? "Persona actualizada y sincronizada" : "Persona actualizada local (pendiente sync)");
}

void handleActualizarRostroPersona() {
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia(60000);
  if (!server.hasArg("id")) {
    server.send(400, "text/plain", "Falta id");
    return;
  }
  if (estadoActual != ESTADO_IDLE) {
    server.send(409, "text/plain", "Sistema ocupado, intente de nuevo");
    return;
  }

  String id = server.arg("id");
  if (id.startsWith("local-")) {
    server.send(409, "text/plain", "Persona local sin ID remoto, sincronice primero");
    return;
  }
  if (!isOnline || WiFi.status() != WL_CONNECTED) {
    server.send(503, "text/plain", "Sin conexion para actualizar rostro");
    return;
  }

  modoEdicionRostro = true;
  personaEditandoId = id;
  idParaRostro = id;
  intentosFacial = 0;
  fotosTomadas = 0;
  rostroRegistroExitoso = false;
  ultimoErrorRegistro = "";
  estadoActual = ESTADO_REGISTRO_FACIAL;
  tiempoUltimoEstado = millis();

  server.send(200, "text/plain", "Mire a la camara para actualizar rostro");
}

void handleAgregarFotosPersona() {
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia(60000);
  if (!server.hasArg("id")) {
    server.send(400, "text/plain", "Falta id");
    return;
  }
  if (estadoActual != ESTADO_IDLE) {
    server.send(409, "text/plain", "Sistema ocupado, intente de nuevo");
    return;
  }

  String id = server.arg("id");
  if (id.startsWith("local-")) {
    server.send(409, "text/plain", "Persona local sin ID remoto, sincronice primero");
    return;
  }
  if (!isOnline || WiFi.status() != WL_CONNECTED) {
    server.send(503, "text/plain", "Sin conexion para agregar fotos");
    return;
  }

  modoEdicionRostro = false;
  personaEditandoId = "";
  idParaRostro = id;
  intentosFacial = 0;
  fotosTomadas = 1;  // Ya existe al menos una foto, saltamos a fotos adicionales
  rostroRegistroExitoso = false;
  ultimoErrorRegistro = "";
  estadoActual = ESTADO_REGISTRO_FACIAL;
  tiempoUltimoEstado = millis();

  server.send(200, "text/plain", "Mire a la camara para capturar " + String(FOTOS_REQUERIDAS - 1) + " foto(s) adicional(es)");
}

void handleBorrarPersona() {
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia();
  if (!server.hasArg("id")) { server.send(400, "text/plain", "Falta ID"); return; }
  String id = server.arg("id");

  if (isOnline && WiFi.status() == WL_CONNECTED && !id.startsWith("local-")) {
    HTTPClient http;
  beginHttp(http, backendURL + "/api/personas/" + id);
    int httpCode = http.sendRequest("DELETE");
    if (httpCode == 200) {
      addLog("Persona borrada en BD remota OK");
    } else {
      addLog("Error borrando persona remota (Cod: " + String(httpCode) + ")");
    }
    http.end();
  }

  DynamicJsonDocument doc(2048);
  JsonArray arr = loadArray("/personas.json", doc);
  for (JsonArray::iterator it = arr.begin(); it != arr.end(); ++it) {
    if ((*it)["id"].as<String>() == id) {
      arr.remove(it);
      saveArray("/personas.json", doc);
      server.send(200, "text/plain", "Persona eliminada");
      return;
    }
  }
  server.send(404, "text/plain", "Persona no encontrada localmente");
}

void handleBorrarTurno() {
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia();
  if (!server.hasArg("id")) { server.send(400, "text/plain", "Falta ID"); return; }
  String id = server.arg("id");

  if (isOnline && WiFi.status() == WL_CONNECTED && !id.startsWith("local-")) {
    HTTPClient http;
  beginHttp(http, backendURL + "/api/turnos/" + id);
    int httpCode = http.sendRequest("DELETE");
    if (httpCode == 200) addLog("Turno borrado en BD remota OK");
    else addLog("Error borrando turno remoto (Cod: " + String(httpCode) + ")");
    http.end();
  }

  DynamicJsonDocument doc(1024);
  JsonArray arr = loadArray("/turnos.json", doc);
  for (JsonArray::iterator it = arr.begin(); it != arr.end(); ++it) {
    if ((*it)["id"].as<String>() == id) {
      arr.remove(it);
      saveArray("/turnos.json", doc);
      server.send(200, "text/plain", "Turno eliminado");
      return;
    }
  }
  server.send(404, "text/plain", "Turno no encontrado");
}

void handleBorrarAsignacion() {
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia();
  if (!server.hasArg("persona") || !server.hasArg("turno")) { server.send(400, "text/plain", "Faltan datos"); return; }
  String persona = server.arg("persona");
  String turno = server.arg("turno");
  
  DynamicJsonDocument doc(1024);
  JsonArray arr = loadArray("/asignaciones.json", doc);
  
  for (JsonArray::iterator it = arr.begin(); it != arr.end(); ++it) {
    if ((*it)["persona_id"].as<String>() == persona && (*it)["turno_id"].as<String>() == turno) {
      
      String backendId = (*it).containsKey("backend_id") ? (*it)["backend_id"].as<String>() : "";
      
      if (isOnline && WiFi.status() == WL_CONNECTED && backendId.length() > 0) {
        HTTPClient http;
  beginHttp(http, backendURL + "/api/asignaciones/" + backendId);
        int httpCode = http.sendRequest("DELETE");
        if (httpCode == 200) addLog("Asignacion borrada en BD remota OK");
        else addLog("Error borrando asignacion remota (Cod: " + String(httpCode) + ")");
        http.end();
      }

