BorgTb/AsistenciaBackendFinal/esp32-cam-solo-rostro/esp32-cam-solo-rostro.ino
      arr.remove(it);
      saveArray("/asignaciones.json", doc);
      server.send(200, "text/plain", "Asignacion eliminada");
      return;
    }
  }
  server.send(404, "text/plain", "Asignacion no encontrada");
}

void handleUltimoRegistro() {
  addLog("[API] GET /ultimo_registro");
  if (!requiereAdmin(server)) return;
  actualizarBloqueoAsistencia(); // No se necesita un bloqueo severo de 120s aquí.
    DynamicJsonDocument doc(2048);
    JsonArray personas = loadArray("/personas.json", doc);
    if (personas.size() == 0) {
        server.send(404, "application/json", "{\"error\": \"No hay registros\"}");
        return;
    }
    JsonObject lastP = personas[personas.size() - 1];
    String json = "{";
    json += "\"id\":\"" + lastP["id"].as<String>() + "\",";
    json += "\"nombre\":\"" + lastP["nombre"].as<String>() + "\",";
    json += "\"rut\":\"" + lastP["rut"].as<String>() + "\",";
    json += "\"imagen_url\":\"" + lastCapturedImageUrl + "\"";
    json += "}";
    server.send(200, "application/json", json);
}

void handleGetPersonas() { addLog("[API] GET /api/personas"); if (!requiereAdmin(server)) return; actualizarBloqueoAsistencia(); servirArchivo("/personas.json", "application/json"); }
void handleGetTurnos() { addLog("[API] GET /api/turnos"); if (!requiereAdmin(server)) return; actualizarBloqueoAsistencia(); servirArchivo("/turnos.json", "application/json"); }
void handleGetAsignaciones() { addLog("[API] GET /api/asignaciones"); if (!requiereAdmin(server)) return; actualizarBloqueoAsistencia(); servirArchivo("/asignaciones.json", "application/json"); }
void handleGetAsistencias() { addLog("[API] GET /api/asistencias (public)"); actualizarBloqueoAsistencia(); servirArchivo("/asistencias.json", "application/json"); }

void WiFiEvent(arduino_event_id_t event, arduino_event_info_t info) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
      addLog("WiFi: Conectado al AP");
      break;
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
      wifiUptimeStart = millis();
      break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED: {
      wifiDisconnectCount++;
      uint8_t reason = info.wifi_sta_disconnected.reason;
      char buf[64];
      snprintf(buf, sizeof(buf), "WiFi: Desconectado (razon %d, contador %d)", reason, wifiDisconnectCount);
      wifiDisconnectReason = String(buf);
      addLog(wifiDisconnectReason);
      break;
    }
    default: break;
  }
}

// ============================================================
// SETUP
// ============================================================
void setup() {
  pinMode(PIR_PIN, INPUT_PULLDOWN);
  addLog("Calibrando sensor PIR...");
  delay(3000);
  pinMode(13, INPUT_PULLUP);
  pinMode(FLASH_PIN, OUTPUT);
  digitalWrite(FLASH_PIN, LOW);
  ledcAttach(FLASH_PIN, FLASH_PWM_FREQ, FLASH_PWM_RES);
  ledcWrite(FLASH_PIN, 0);
  if (digitalRead(13) == LOW) {
    delay(1000);
    if (digitalRead(13) == LOW) {
      initLittleFS(); saveConfig("", "", backendURL, mqttBroker, ""); Serial.println("RESET DETECTADO");
    }
  }
  
  Serial.begin(115200); delay(1000);

  WiFi.onEvent(WiFiEvent);

  initCamera(); delay(500);

  pinMode(GREEN_LED_PIN, OUTPUT);
  digitalWrite(GREEN_LED_PIN, LOW);
  digitalWrite(GREEN_LED_PIN, HIGH); delay(100);
  digitalWrite(GREEN_LED_PIN, LOW);

  initLittleFS(); delay(500); loadWiFiConfig(); tryConnectWiFi();
  
  if (isOnline) {
    sincronizarPendientes();
    sincronizarPersonasDesdeBackend();
    sincronizarTurnosDesdeBackend();
    sincronizarAsignacionesDesdeBackend();
  } else {
      delay(500);
      WiFi.mode(WIFI_AP);
      delay(150);
      WiFi.softAP(apSSID, apPASS, 6, 0, 4);
      delay(150);
      WiFi.softAPConfig(IPAddress(192, 168, 4, 1), IPAddress(192, 168, 4, 1), IPAddress(255, 255, 255, 0));
      addLog("AP iniciado. IP=" + WiFi.softAPIP().toString() + " | PASS=" + String(apPASS));
  }

  // Rutas HTML
  server.on("/", []() { actualizarBloqueoAsistencia(); servirArchivo("/index.html", "text/html"); });
  server.on("/register", []() { actualizarBloqueoAsistencia(60000); servirArchivo("/register.html", "text/html"); });
  server.on("/gestion", []() { actualizarBloqueoAsistencia(); servirArchivo("/gestion.html", "text/html"); });
  server.on("/personas", []() { actualizarBloqueoAsistencia(); servirArchivo("/personas.html", "text/html"); });
  server.on("/asistencias", []() { actualizarBloqueoAsistencia(); servirArchivo("/asistencias.html", "text/html"); });
  server.on("/turnos", []() { actualizarBloqueoAsistencia(); servirArchivo("/turnos.html", "text/html"); });
  server.on("/asignaciones", []() { actualizarBloqueoAsistencia(); servirArchivo("/asignaciones.html", "text/html"); });
  server.on("/wifi-setup", []() { actualizarBloqueoAsistencia(60000); servirArchivo("/wifi-setup.html", "text/html"); });
  server.on("/logs", []() { servirArchivo("/logs.html", "text/html"); });
  
  // Rutas de Acción
  server.on("/wifi-config", handleWiFiConfig);
  server.on("/registrar", handleRegisterUser);
  server.on("/crear_turno", handleCreateTurn);
  server.on("/asignar", handleAssignTurn);
  server.on("/limpiar", handleLimpiarDatos);
  server.on("/sincronizar", handleSincronizar);
  server.on("/fetch-personas", handleFetchPersonas);
  server.on("/set-backend", handleSetBackend);
  server.on("/editar_persona", handleEditarPersona);
  server.on("/actualizar_rostro", handleActualizarRostroPersona);
  server.on("/agregar_fotos", handleAgregarFotosPersona);
  server.on("/borrar_persona", handleBorrarPersona);
  server.on("/borrar_turno", handleBorrarTurno);
  server.on("/borrar_asignacion", handleBorrarAsignacion);
  
  // Rutas API REST
  server.on("/api/personas", handleGetPersonas);
  server.on("/api/turnos", handleGetTurnos);
  server.on("/api/asignaciones", handleGetAsignaciones);
  server.on("/api/asistencias", handleGetAsistencias);
  server.on("/api/logs", []() {
    addLog("[API] GET /api/logs");
    if (!requiereAdmin(server)) return;
    String contenido = logBuffer;
    if (contenido.length() == 0) contenido = "Sin logs disponibles";
    addLog("[API] /api/logs -> 200 (" + String(contenido.length()) + " bytes)");
    server.send(200, "text/html", contenido);
  });
  server.on("/api/logs/clear", []() {
    addLog("[API] GET /api/logs/clear");
    if (!requiereAdmin(server)) return;
    logBuffer = "";
    addLog("[API] /api/logs/clear -> 200");
    server.send(200, "text/plain", "Logs limpiados");
  });
  server.on("/ultimo_registro", handleUltimoRegistro); 

  server.on("/estado", []() {
    String referer = server.header("Referer");
    if (referer.indexOf("/register") >= 0 || referer.indexOf("/wifi-setup") >= 0 ||
        (referer.indexOf("/gestion") >= 0 && estadoActual != ESTADO_IDLE)) {
      actualizarBloqueoAsistencia();
    }

    DynamicJsonDocument docPersonas(2048);
    DynamicJsonDocument docAsignaciones(1024);
    DynamicJsonDocument docAsistencias(2048);
    JsonArray personas = loadArray("/personas.json", docPersonas);
    JsonArray asignaciones = loadArray("/asignaciones.json", docAsignaciones);
    JsonArray asistencias = loadArray("/asistencias.json", docAsistencias);
    String motivoAuto = motivoAsistenciaAutomatica(millis());

    String json = "{";
    json += "\"estado\":\""  + String(estadoActual == ESTADO_IDLE ? "idle" : "ocupado") + "\",";
    json += "\"codigo_paso\":" + String(estadoActual) + ",";
    json += "\"intentos_facial\":" + String(intentosFacial) + ",";
    json += "\"online\":"    + String(isOnline ? "true" : "false") + ",";
    json += "\"camara\":"    + String(camaraIniciada ? "true" : "false") + ",";
    json += "\"rostro_ok\":" + String(rostroRegistroExitoso ? "true" : "false") + ",";
    json += "\"error_registro\":\"" + jsonEscape(ultimoErrorRegistro) + "\",";
    json += "\"asistencia_bloqueada\":" + String(millis() < bloqueoAsistenciaHasta ? "true" : "false") + ",";
    json += "\"bloqueo_restante_ms\":" + String(millis() < bloqueoAsistenciaHasta ? (bloqueoAsistenciaHasta - millis()) : 0) + ",";
    json += "\"asistencia_auto_huella_habilitada\":" + String(motivoAuto == "habilitada" ? "true" : "false") + ",";
    json += "\"motivo_asistencia_auto\":\"" + motivoAuto + "\",";
    json += "\"personas_locales\":" + String(personas.size()) + ",";
    json += "\"asignaciones_locales\":" + String(asignaciones.size()) + ",";
    json += "\"asistencias_locales\":" + String(asistencias.size()) + ",";
    json += "\"backend\":\"" + backendURL + "\",";
    json += "\"mqtt\":\""    + mqttBroker + "\",";
    json += "\"ssid\":\""    + jsonEscape(savedSSID) + "\",";
    json += "\"enrolado\":"  + String(estaEnrolado ? "true" : "false") + ",";
    json += "\"admin_protegido\":" + String(adminHash.length() > 0 ? "true" : "false") + ",";
    json += "\"mac\":\""     + deviceMAC + "\"";
    json += "}";
    server.send(200, "application/json", json);
  });

  server.on("/wifi-diag", []() {
    String json = "{";
    json += "\"online\":" + String(isOnline ? "true" : "false") + ",";
    json += "\"ssid\":\"" + jsonEscape(savedSSID) + "\",";
    json += "\"rssi\":" + String(WiFi.RSSI()) + ",";
    json += "\"ip\":\"" + (WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : "—") + "\",";
    json += "\"mac\":\"" + deviceMAC + "\",";
    String canal = "N/A";
    if (isOnline) canal = String(WiFi.channel());
    json += "\"canal\":" + canal + ",";
    json += "\"disconnects\":" + String(wifiDisconnectCount) + ",";
    json += "\"last_disconnect_reason\":\"" + jsonEscape(wifiDisconnectReason) + "\",";
    unsigned long uptime = (wifiUptimeStart > 0 && isOnline) ? (millis() - wifiUptimeStart) / 1000 : 0;
    json += "\"wifi_uptime_seg\":" + String(uptime) + ",";
    json += "\"heap_free\":" + String(ESP.getFreeHeap()) + ",";
    json += "\"uptime_total_seg\":" + String(millis() / 1000);
    json += "}";
    server.send(200, "application/json", json);
  });

  server.begin();
  addLog("Sistema web iniciado.");
}

