BorgTb/AsistenciaBackendFinal/esp32-cam-solo-rostro/esp32-cam-solo-rostro.ino
// ============================================================
// LOOP PRINCIPAL
// ============================================================
// ============================================================
// LOOP PRINCIPAL
// ============================================================
// ============================================================
// LOOP PRINCIPAL
// ============================================================
void loop() {
  server.handleClient();
  yield();


  if (savedSSID.length() > 0) verificarConexionWiFi();

  if (isOnline && mqtt_client == NULL) mantenerConexionMQTT();
  unsigned long ahora = millis();
  
  if (estadoActual != ESTADO_IDLE && estadoActual != ESTADO_PROCESANDO_ASISTENCIA && (ahora - tiempoUltimoEstado) > TIMEOUT_REGISTRO) {
    addLog("Timeout de registro. Volviendo a inactivo.");
    ledcWrite(FLASH_PIN, 0);
    estadoActual = ESTADO_IDLE;
  }

  // ==========================================================
  // LÓGICA DE ASISTENCIA HÍBRIDA POR DEMANDA (CONTROLADA POR PIR)
  // ==========================================================
  if (estadoActual == ESTADO_IDLE) {
    String motivoAuto = motivoAsistenciaAutomatica(ahora);
    if (!isOnline && motivoAuto != "habilitada" && (ahora - ultimoLogDiagnosticoOffline) > 15000) {
      ultimoLogDiagnosticoOffline = ahora;
      addLog("[OFFLINE] Auto-asistencia inactiva: " + motivoAuto);
    }

    // 1. EL PIR ES EL PORTERO: Solo si detecta movimiento, activamos un "modo alerta" de 15 segundos
    static unsigned long tiempoUltimoMovimiento = 0;
    static bool hayAlguienFrenteAlSensor = false;

    // 1. EL PIR ES EL PORTERO
    if (digitalRead(PIR_PIN) == HIGH) {
      if (!hayAlguienFrenteAlSensor) {
      addLog("Movimiento detectado. Flash ON por 10 segundos...");
      hayAlguienFrenteAlSensor = true;
      tiempoUltimoMovimiento = ahora;
      ledcWrite(FLASH_PIN, FLASH_DUTY_LOW); // Flash ON al detectar
      delay(800);
      return;
    }
      tiempoUltimoMovimiento = ahora;
    }

    // 2. SOLO SI HAY ALGUIEN, USAMOS LA CÁMARA Y LA HUELLA
    if (hayAlguienFrenteAlSensor) {
      
      // --- NUEVO: TIMEOUT DEL PIR (Anti-Bucle) ---
      // Si el sensor no ha vuelto a detectar movimiento en los últimos 15 segundos,
      // asumimos que fue una falsa alarma o la persona se retiró.
      if (ahora - tiempoUltimoMovimiento > 15000) {
          addLog("Sin movimiento 10s. Flash OFF, sistema a reposo.");
          ledcWrite(FLASH_PIN, 0); // Flash OFF al expirar
          hayAlguienFrenteAlSensor = false;
          return; // Salimos del loop inmediatamente para no sacar fotos en falso
      }
      // -------------------------------------------

      // -- INTENTO FACIAL --
      if (isOnline && (ahora - cooldownAsistencia > COOLDOWN_TIEMPO) && (ahora - lastFaceCheck > FACE_CHECK_INTERVAL)) {
        lastFaceCheck = ahora;
        String personaIdEncontrada = identificarPorRostro(); 
        if (personaIdEncontrada != "" && personaIdEncontrada != "unknown") {
            estadoActual = ESTADO_PROCESANDO_ASISTENCIA;
            String res = procesarAsistencia(personaIdEncontrada, "facial");
            addLog(res);
            if (resultadoAsistenciaExitosa(res)) flashExito(); else flashError();
            cooldownAsistencia = millis();
            ledcWrite(FLASH_PIN, 0);
            hayAlguienFrenteAlSensor = false; 
            
            estadoActual = ESTADO_IDLE; 
        }
      }

      // -- SIN INTENTO HUELLA (solo facial) --
    } // Fin del bloque "if (hayAlguienFrenteAlSensor)"
  }

  // ==========================================================
  // FLUJO DE REGISTRO FACIAL
  // ==========================================================
  if (estadoActual == ESTADO_REGISTRO_FACIAL) {
    static unsigned long ultimoIntentoFoto = 0;
    if (ahora - ultimoIntentoFoto > 4000) { 
      ultimoIntentoFoto = ahora;
      intentosFacial++;
      
      bool excedido = (fotosTomadas >= FOTOS_REQUERIDAS) || (intentosFacial > 15);
      
      if (excedido && fotosTomadas == 0) {
        ledcWrite(FLASH_PIN, 0);
        flashError();
        addLog("No se pudo registrar rostro tras multiples intentos");
        ultimoErrorRegistro = "No se pudo registrar rostro tras multiples intentos";
        estadoActual = ESTADO_IDLE;
        nombreRegistrando = ""; rutRegistrando = ""; emailRegistrando = "";
        idParaRostro = "";
        modoEdicionRostro = false;
        personaEditandoId = "";
        fotosTomadas = 0;
      } else if (excedido && fotosTomadas > 0) {
        ledcWrite(FLASH_PIN, 0);
        flashExito();
        addLog("Registro completo: " + String(fotosTomadas) + " foto(s) de referencia guardada(s)");
        rostroRegistroExitoso = true;
        ultimoErrorRegistro = "";
        estadoActual = ESTADO_IDLE;
        nombreRegistrando = ""; rutRegistrando = ""; emailRegistrando = "";
        idParaRostro = "";
        modoEdicionRostro = false;
        personaEditandoId = "";
        fotosTomadas = 0;
      } else if (fotosTomadas == 0) {
        addLog("Enviando fotografia #" + String(intentosFacial) + " para registro inicial...");
        if (!registrarRostroEnBackend(idParaRostro)) {
          addLog("No se pudo enviar foto por MQTT. Reintentando...");
          if (mqtt_client == NULL && mqttBroker != "") mantenerConexionMQTT();
        }
      } else {
        addLog("Tomando fotografia adicional #" + String(fotosTomadas + 1) + "/" + String(FOTOS_REQUERIDAS) + "...");
        delay(1500);
        if (agregarFotoEnBackend(idParaRostro)) {
          fotosTomadas++;
          if (fotosTomadas >= FOTOS_REQUERIDAS) {
            ledcWrite(FLASH_PIN, 0);
            flashExito();
            addLog("Registro completo: " + String(fotosTomadas) + " fotos de referencia guardadas");
            rostroRegistroExitoso = true;
            ultimoErrorRegistro = "";
            estadoActual = ESTADO_IDLE;
            nombreRegistrando = ""; rutRegistrando = ""; emailRegistrando = "";
            idParaRostro = "";
            modoEdicionRostro = false;
            personaEditandoId = "";
            fotosTomadas = 0;
          } else {
            addLog("Foto adicional OK. Siguiente en 4 segundos...");
          }
        } else {
          addLog("Error en foto adicional. Reintentando...");
        }
      }
    }
  }

  if (mqttConnected && mqtt_client != NULL && (ahora - lastHeartbeat) > 30000UL) {
    lastHeartbeat = ahora;
    String topic = "esp32/heartbeat/" + deviceMAC;
    String payload = "{\"mac\":\"" + deviceMAC + "\",\"t\":" + String(millis()) + ",\"ip\":\"" + WiFi.localIP().toString() + "\"}";
    esp_mqtt_client_publish(mqtt_client, topic.c_str(), payload.c_str(), 0, 0, 0);
  }

  static unsigned long lastSync = 0;
  if (isOnline && (ahora - lastSync) > 300000UL) {
    lastSync = ahora;
    sincronizarPendientes();
  }

  static unsigned long lastErpSync = 0;
  if (isOnline && (ahora - lastErpSync) > 360000UL) {
    lastErpSync = ahora;
    sincronizarErpConfigDesdeBackend();
  }

  // Respiro al servidor Web y RTOS para evitar congelamientos en la protoboard
  delay(20); 
}
